literate/executors/ExplicitReturn.org
#+TITLE: Explicit Return Executor service
#+PROPERTY: header-args    :comments both :tangle ../../src/executors/explicitReturn.js

Executors must be XState services and for this one we've chosen the callback type of service.

#+begin_src js
import { Category } from "concrete-parser";
export const service = (C) => (sendParent, receiveParent) => {
    sendParent({ type: "EXPLICIT_RETURN" });
};
#+end_src


